KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L475.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DMA1">
         <name>DMA2</name>
         <baseAddress>0x40020400</baseAddress>
         <interrupt>
            <name>DMA2_CH1</name>
            <description>DMA2 Channel 1 global Interrupt</description>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH2</name>
            <description>DMA2 Channel 2 global Interrupt</description>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH3</name>
            <description>DMA2 Channel 3 global Interrupt</description>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH4</name>
            <description>DMA2 Channel 4 global Interrupt</description>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH5</name>
            <description>DMA2 Channel 5 global Interrupt</description>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH6</name>
            <description>DMA2 Channel 6 global Interrupt</description>
            <value>68</value>
         </interrupt>
         <interrupt>
            <name>DMA2_CH7</name>
            <description>DMA2 Channel 7 global Interrupt</description>
            <value>69</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>CRC</name>
         <description>Cyclic redundancy check calculation       unit</description>
         <groupName>CRC</groupName>
         <baseAddress>0x40023000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>Data register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data register bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <displayName>IDR</displayName>
               <description>Independent data register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IDR</name>
                     <description>General-purpose 8-bit data register               bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REV_OUT</name>
                     <description>Reverse output data</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>REV_IN</name>
                     <description>Reverse input data</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POLYSIZE</name>
                     <description>Polynomial size</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RESET</name>
                     <description>RESET bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>INIT</name>
               <displayName>INIT</displayName>
               <description>Initial CRC value</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>CRC_INIT</name>
                     <description>Programmable initial CRC               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <displayName>POL</displayName>
               <description>polynomial</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>Polynomialcoefficients</name>
                     <description>Programmable polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
