KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L475.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RCC</name>
         <description>Reset and clock control</description>
         <groupName>RCC</groupName>
         <baseAddress>0x40021000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RCC</name>
            <description>RCC global interrupt</description>
            <value>5</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Clock control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000063</resetValue>
               <fields>
                  <field>
                     <name>PLLSAI2RDY</name>
                     <description>SAI2 PLL clock ready flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PLLSAI2ON</name>
                     <description>SAI2 PLL enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PLLSAI1RDY</name>
                     <description>SAI1 PLL clock ready flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PLLSAI1ON</name>
                     <description>SAI1 PLL enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PLLRDY</name>
                     <description>Main PLL clock ready flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PLLON</name>
                     <description>Main PLL enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CSSON</name>
                     <description>Clock security system               enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>HSEBYP</name>
                     <description>HSE crystal oscillator               bypass</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSERDY</name>
                     <description>HSE clock ready flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSEON</name>
                     <description>HSE clock enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSIASFS</name>
                     <description>HSI automatic start from               Stop</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSIRDY</name>
                     <description>HSI clock ready flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSIKERON</name>
                     <description>HSI always enable for peripheral               kernels</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSION</name>
                     <description>HSI clock enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSIRANGE</name>
                     <description>MSI clock ranges</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSIRGSEL</name>
                     <description>MSI clock range selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>MSIPLLEN</name>
                     <description>MSI clock PLL enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSIRDY</name>
                     <description>MSI clock ready flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSION</name>
                     <description>MSI clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICSCR</name>
               <displayName>ICSCR</displayName>
               <description>Internal clock sources calibration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>HSITRIM</name>
                     <description>HSI clock trimming</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSICAL</name>
                     <description>HSI clock calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSITRIM</name>
                     <description>MSI clock trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSICAL</name>
                     <description>MSI clock calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>Clock configuration register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCOPRE</name>
                     <description>Microcontroller clock output               prescaler</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MCOSEL</name>
                     <description>Microcontroller clock               output</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STOPWUCK</name>
                     <description>Wakeup from Stop and CSS backup clock               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PPRE2</name>
                     <description>APB high-speed prescaler               (APB2)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PPRE1</name>
                     <description>PB low-speed prescaler               (APB1)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HPRE</name>
                     <description>AHB prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SWS</name>
                     <description>System clock switch status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>System clock switch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLCFGR</name>
               <displayName>PLLCFGR</displayName>
               <description>PLL configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>PLLR</name>
                     <description>Main PLL division factor for PLLCLK               (system clock)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLREN</name>
                     <description>Main PLL PLLCLK output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLQ</name>
                     <description>Main PLL division factor for               PLLUSB1CLK(48 MHz clock)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLQEN</name>
                     <description>Main PLL PLLUSB1CLK output               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLP</name>
                     <description>Main PLL division factor for PLLSAI3CLK               (SAI1 and SAI2 clock)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLPEN</name>
                     <description>Main PLL PLLSAI3CLK output               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLN</name>
                     <description>Main PLL multiplication factor for               VCO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PLLM</name>
                     <description>Division factor for the main PLL and               audio PLL (PLLSAI1 and PLLSAI2) input               clock</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PLLSRC</name>
                     <description>Main PLL, PLLSAI1 and PLLSAI2 entry               clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLPDIV</name>
                     <description>Main PLL division factor for               PLLSAI2CLK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLSAI1CFGR</name>
               <displayName>PLLSAI1CFGR</displayName>
               <description>PLLSAI1 configuration register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>PLLSAI1R</name>
                     <description>PLLSAI1 division factor for PLLADC1CLK               (ADC clock)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1REN</name>
                     <description>PLLSAI1 PLLADC1CLK output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1Q</name>
                     <description>SAI1PLL division factor for PLLUSB2CLK               (48 MHz clock)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1QEN</name>
                     <description>SAI1PLL PLLUSB2CLK output               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1P</name>
                     <description>SAI1PLL division factor for PLLSAI1CLK               (SAI1 or SAI2 clock)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1PEN</name>
                     <description>SAI1PLL PLLSAI1CLK output               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1N</name>
                     <description>SAI1PLL multiplication factor for               VCO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1PDIV</name>
                     <description>PLLSAI1 division factor for               PLLSAI1CLK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLLSAI2CFGR</name>
               <displayName>PLLSAI2CFGR</displayName>
               <description>PLLSAI2 configuration register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>PLLSAI2R</name>
                     <description>PLLSAI2 division factor for PLLADC2CLK               (ADC clock)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2REN</name>
                     <description>PLLSAI2 PLLADC2CLK output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2P</name>
                     <description>SAI1PLL division factor for PLLSAI2CLK               (SAI1 or SAI2 clock)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2PEN</name>
                     <description>SAI2PLL PLLSAI2CLK output               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2N</name>
                     <description>SAI2PLL multiplication factor for               VCO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2PDIV</name>
                     <description>PLLSAI2 division factor for               PLLSAI2CLK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIER</name>
               <displayName>CIER</displayName>
               <description>Clock interrupt enable           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSECSSIE</name>
                     <description>LSE clock security system interrupt               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI2RDYIE</name>
                     <description>PLLSAI2 ready interrupt               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAI1RDYIE</name>
                     <description>PLLSAI1 ready interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLRDYIE</name>
                     <description>PLL ready interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSERDYIE</name>
                     <description>HSE ready interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSIRDYIE</name>
                     <description>HSI ready interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSIRDYIE</name>
                     <description>MSI ready interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSERDYIE</name>
                     <description>LSE ready interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSIRDYIE</name>
                     <description>LSI ready interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI48RDYIE</name>
                     <description>HSI48 ready interrupt               enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
